{"class_name": "Sequential", "keras_version": "2.0.4", "backend": "tensorflow", "config": [{"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_regularizer": null, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_1", "gamma_constraint": null, "center": true, "dtype": "float32", "beta_regularizer": null, "batch_input_shape": [null, 64, 224, 3], "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "data_format": "channels_last", "name": "conv2d_1", "activation": "relu", "bias_regularizer": null, "kernel_size": [5, 5], "filters": 8, "strides": [1, 1], "bias_constraint": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "data_format": "channels_last", "name": "conv2d_2", "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "strides": [1, 1], "bias_constraint": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "data_format": "channels_last", "name": "conv2d_3", "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "strides": [1, 1], "bias_constraint": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "data_format": "channels_last", "name": "conv2d_4", "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "filters": 128, "strides": [1, 1], "bias_constraint": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "data_format": "channels_last", "name": "conv2d_5", "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "filters": 256, "strides": [1, 1], "bias_constraint": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "data_format": "channels_last", "name": "conv2d_6", "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "filters": 256, "strides": [1, 1], "bias_constraint": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "data_format": "channels_last", "name": "conv2d_7", "activation": "relu", "bias_regularizer": null, "kernel_size": [3, 3], "filters": 256, "strides": [1, 1], "bias_constraint": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "activation": "relu", "units": 1024, "use_bias": true, "bias_constraint": null, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "activation": "linear", "units": 1, "use_bias": true, "bias_constraint": null, "bias_regularizer": null}}]}